Hi @Sonic-Pancake, thank you for submitting this issue. It looks like you have filled in the wrong value in remote_auth. 

**Example:**
```hcl
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

resource "fortios_system_admin" "adadmin" {
  name         = "adadmin"
  accprofile   = "super_admin"
  remote_auth  = "enable"            #<=================
  remote_group = "ldapgrp"
  wildcard     = "enable"
  vdom {
    name = "root"
  }
}

```
```
# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_admin.adadmin will be created
  + resource "fortios_system_admin" "adadmin" {
      + accprofile                 = "super_admin"
      + accprofile_override        = (known after apply)
      + allow_remove_admin_session = (known after apply)
      + dynamic_sort_subtable      = "false"
      + email_to                   = (known after apply)
      + force_password_change      = (known after apply)
      + fortitoken                 = (known after apply)
      + guest_auth                 = (known after apply)
      + guest_lang                 = (known after apply)
      + hidden                     = (known after apply)
      + id                         = (known after apply)
      + ip6_trusthost1             = (known after apply)
      + ip6_trusthost10            = (known after apply)
      ..............................
      + two_factor                 = (known after apply)
      + two_factor_authentication  = (known after apply)
      + two_factor_notification    = (known after apply)
      + wildcard                   = "enable"

      + vdom {
          + name = "root"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_admin.adadmin: Creating...
fortios_system_admin.adadmin: Creation complete after 0s [id=adadmin]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

```
# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_system_admin.adadmin: Refreshing state... [id=adadmin]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

Validation:
```
labfirewall # config system admin

labfirewall (admin) # show
config system admin
    edit "admin"
        set accprofile "super_admin"
        set vdom "root"
        set password ENC SH2btxigDHvD/bxqyrUjNUedUfwysRqiI5/B6C5S3FHufkAb4tUI4QOHSHnA7o=
    next
    edit "adadmin"
        set remote-auth enable
        set accprofile "super_admin"
        set vdom "root"
        set wildcard enable
        set remote-group "ldapgrp"
    next
end

```
BTW:  As described in https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/guides/fgt_token  : _If you want to configure VDOM or resources related to administrator user permissions, you need to set the field with the System predefined Administrator Profile super_admin by CLI._ This means that the api_user who owns the provider's token needs to configure super_admin accprofile to have the authority to configure admin related resources.

Can you please try again? Thank you!